In [1]:
import pandas as pd
import sqlalchemy
import marcus_keys

In [2]:
iata_lst = ['BER', 'HAM', 'STR', 'DUS']
city_lst = ["Berlin", "Hamburg", "Stuttgart", "Duesseldorf"]
country_lst = ["DE", "DE", "DE", "DE"]
q_id_lst = ["Q64", "Q1055", "Q1022", "Q1718"]
airport_name_lst = ["Berlin-Brandenburg", "Hamburg", "Stuttgart", "Düsseldorf"]

cities_df = pd.DataFrame({"city_id": q_id_lst, "city_name": city_lst, "country_code": country_lst})
city_airport_df = pd.DataFrame({"city_id":q_id_lst, "iata_code":iata_lst})
airports_df = pd.DataFrame({"iata_code":iata_lst, "airport_name":airport_name_lst})

In [7]:
cities_df

  city_id    city_name country_code
0     Q64       Berlin           DE
1   Q2079      Leipzig           DE
2   Q1055      Hamburg           DE
3   Q1731      Dresden           DE
4   Q1022    Stuttgart           DE
5   Q1718  Duesseldorf           DE
6    Q365      Cologne           DE

In [8]:
cities_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   city_id       7 non-null      object
 1   city_name     7 non-null      object
 2   country_code  7 non-null      object
dtypes: object(3)
memory usage: 296.0+ bytes

In [9]:
city_airport_df

  city_id iata_code
0     Q64       BER
1   Q2079       LEJ
2   Q1055       HAM
3   Q1731       DRS
4   Q1022       STR
5   Q1718       DUS
6    Q365       CGN

In [10]:
city_airport_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   city_id    7 non-null      object
 1   iata_code  7 non-null      object
dtypes: object(2)
memory usage: 240.0+ bytes

In [11]:
airports_df

  iata_code        airport_name
0       BER  Berlin-Brandenburg
1       LEJ       Leipzig-Halle
2       HAM             Hamburg
3       DRS             Dresden
4       STR           Stuttgart
5       DUS          Düsseldorf
6       CGN           Köln-Bonn

In [12]:
airports_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   iata_code     7 non-null      object
 1   airport_name  7 non-null      object
dtypes: object(2)
memory usage: 240.0+ bytes

# Local MySQL Connection

In [24]:
schema="p5_gans_database"
host="127.0.0.1"
user="root"
password=marcus_keys.my_sql_key
port=3306
con = f'mysql+pymysql://{user}:{password}@{host}:{port}/{schema}'

# AWS RDS MySQL Connection

In [3]:
schema="aws_p5_gans_database"
host="wbs-cs-p5-db.cjdcbdhnueky.eu-north-1.rds.amazonaws.com"
user="mkadmin"
password=marcus_keys.aws_rds_key
port=3306
con = f'mysql+pymysql://{user}:{password}@{host}:{port}/{schema}'

# Uploading the DataFrames into the database

In [4]:
cities_df.to_sql('city_table', 
                if_exists='append', 
                con=con, 
                index=False)

4

In [5]:
airports_df.to_sql('airport_table', 
                  if_exists='append', 
                  con=con, 
                  index=False)

4

In [6]:
city_airport_df.to_sql('city_airport_table', 
                       if_exists='append', 
                       con=con, 
                       index=False)

4